

[
  {
    "sectionId": 0,
    "paragraph01": "The ideal jobs for each person in the group has remained unchanged from Assignment 1 and 2. The table shown above shows the 6 different job titles, with the skills and preferred skills compared for each job title. In terms of similarities, there are a couple of skills and traits that are common amongst all 6 jobs. These include communication, teamwork, attention to detail and ongoing learning in both team and individual settings. For programming languages, 4 out of 6 have Python and 3 out of 6 have C++. DevOps Engineer and Full Stack developer share Java, whilst Full Stack and Microsoft Software engineer share JavaScript. Despite Full Stack developer and Data systems engineer explicitly mentioning the skill to write concise, clear code, the ability to code in a meticulous manner is no doubt important for any of the 6 jobs.",
    "paragraph02": "Automation and testing are skills shared between DevOps and Full Stack developer, however, when viewing the positions of responsibility of each job, it can be inferred that the ability to test code and software is equally important across 6 jobs. ICT Service Team leader and Microsoft software engineer both share demonstrated leadership qualities, IT Security principles and understanding of Windows’ internal systems and software. Following on from skills of Microsoft Software Engineer, they also require knowledge in a cloud computing service – Microsoft Azure. When comparing to other jobs, there is no explicit mention of Microsoft Azure, however, Data Systems and Senior DevOps engineer require knowledge in other cloud computing platforms such as Kubernetes.",
    "paragraph03": "Knowledge of Linux as an operating system is important amongst DevOps, Software and Data Systems engineer. End-end deployment automation is also an important skill in both Data systems and DevOps Engineer.",
    "paragraph04": "Aside from different skillsets and knowledge for each of the 6 jobs, there are also other aspects that differentiate each job from another. From a general perspective, a Full Stack Developer is in charge of maintaining both front and back-end programming languages, whilst working with key stockholders and team members to consistently deliver projects and solutions. Microsoft Software Engineer focuses on working with Azure team members and stakeholders. They will utilize their technical expertise in cyber security principles to lead security-based programs and address any vulnerabilities within Microsoft. Senior Big Data DevOps engineer will lead the end-end deployment of automation services, working closely with Developers, Engineers and Customer support to resolve issues relating to Big Data technology and applications that are run on Azure or Cloud environments.",
    "paragraph05": "Senior Games programmer will be in charge of using their excellent skills in C# and C++ within the gaming industry, working with both developers and programmers, to create a fully functional and marketable video games. ICT Service leader will lead an ICT team with their exceptional leadership and technical skills. They will be working with both stakeholders and small to medium clients, to deliver a consistent high level of performance and service. Data Systems Engineer will focus on collaborating with the Artificial intelligence team, working with petabytes of images to help build, design and operate data systems, which will then be using for modelling and training.",
    "paragraph06": "The 6 jobs differ in the way they deal with aspects of the IT industry. Regardless of which career plan is selected, it can be inferred that there will be some collaboration with stakeholders within the company when delivering products or projects. Each job will deal with programming in some form, whether it be in web development, cyber security, general IT issues, game development, modelling data or end-end deployment. The main difference is the IT field and processes where they take place.",    
    "paragraph07": ""
}
]