[
  {
    "sectionId": 0,
    "name":"Dhani",
    "paragraph":""
  },
  {
    "sectionId": 1,
    "name":"Justin",
    "paragraph":"Unfortunately, sickness and personal issues as well as increased work commitments had a slight impact on this assessment. I believe our team pulled together and rallied in the face of these issues and were able to produce a great result. Most of the meetings were attended by all and all videos and minutes were watched and read by missing team members. Communication was lower outside of our meetings than the last assessment, but this could be attributed to the issues our team was facing outside of study. Most tasks were achieved by their assigned deadlines and team members were assigned to tasks that properly aligned with their strengths."
  },
  {
    "sectionId": 2,
    "name":"Zenithon",
    "paragraph":"As a group, I believe we were able to work together to complete the task successfully. Between the 6 of us, tasks were allocated accordingly in a 50% ratio, with half of the group working on the report, whilst the other half would work on the app development. Meetings were attended by most members, with some absent due to work/personal issues. Unfortunately, I believe communication could have been significantly improved in this assessment in contrast to the last. In some cases, lack of communication resulted in deadlines not being reached and conflict between the group. In spite of this, some group members were always on top of tasks and safety nets were created in the event a deadline was not reached. This would allow the assessment to be submitted on time without causing a big issue if certain tasks were not completed in time."
  },
  {
    "sectionId": 3,
    "name":"Nathan",
    "paragraph":"Due to personal issues in my life, I was unable to provide support to my team as much as I would have liked too, I missed a lot of the meetings but was able to keep up to date via meeting notes the team members done. I really appreciate my team being supportive of me while I have been going through a difficult time in my life. Communication was very important to the team and as I can see on the teams messages was frequent, all members was able to do their tasks on time."
  },
  {
    "sectionId": 4,
    "name":"Oliver",
    "paragraph":"We worked well as a team but there were circumstances where deadlines were not met from team members due to personal/work reasons. Communication was down on this assignment from the last as members commitments outside of study got in the way. Most deadlines were met with the help of the rest of the group helping get things done on time. All tasks were assigned on a 50/50 basis with half the group working on the report while the other half worked on the development of the app. Other than those that have been mentioned the group produced a product that we should all be proud of."
  },
  {
    "sectionId": 5,
    "name":"Brearne",
    "paragraph":""
  }
]