[
  {
    "sectionId": 0,
    "name":"Dhani",
    "paragraph":"These two assessment tasks were more challenging than the previous assessment. The contribution was unevenly spread across the group members due to external factors such as work commitments and personal issues. This changed the dynamic of the team as some of the group members had to take on some of the workload from other members in order for tasks to be completed as initial deadlines were not being met. The main cause for this was a lack of communication from members of the group who did not reach out or indicate that they were struggling completing their assigned deliverables by given deadlines. Group members that were in the background in the previous assessment really stepped-up in their contribution this time around. Working in a group comes with uncertainty, situations came arise which you have no control over. However, this should not impede the progress of a deliverable if the majority of the team is still able to function. This was the case for our group and we had to adapt and re-allocate tasks accordingly so that the assessments could still be submitted on time. The group can decide whether the reduced contribution of other group members will affect the final deliverable and then take appropriate actions. In the end, the group pushed through and were able to submit quality deliverables for both assessment tasks."
  },
  {
    "sectionId": 1,
    "name":"Justin",
    "paragraph":"Unfortunately, sickness and personal issues as well as increased work commitments had a slight impact on this assessment. I believe our team pulled together and rallied in the face of these issues and were able to produce a great result. Most of the meetings were attended by all and all videos and minutes were watched and read by missing team members. Communication was lower outside of our meetings than the last assessment, but this could be attributed to the issues our team was facing outside of study. Most tasks were achieved by their assigned deadlines and team members were assigned to tasks that properly aligned with their strengths."
  },
  {
    "sectionId": 2,
    "name":"Zenithon",
    "paragraph":"As a group, I believe we were able to work together to complete the task successfully. Between the 6 of us, tasks were allocated accordingly in a 50% ratio, with half of the group working on the report, whilst the other half would work on the app development. Meetings were attended by most members, with some absent due to work/personal issues. Unfortunately, I believe communication could have been significantly improved in this assessment in contrast to the last. In some cases, lack of communication resulted in deadlines not being reached and conflict between the group. In spite of this, some group members were always on top of tasks and safety nets were created in the event a deadline was not reached. This would allow the assessment to be submitted on time without causing a big issue if certain tasks were not completed in time."
  },
  {
    "sectionId": 3,
    "name":"Nathan",
    "paragraph":"Due to personal issues in my life, I was unable to provide support to my team as much as I would have liked too, I missed a lot of the meetings but was able to keep up to date via meeting notes the team members done. I really appreciate my team being supportive of me while I have been going through a difficult time in my life. Communication was very important to the team and as I can see on the teams messages was frequent, all members was able to do their tasks on time."
  },
  {
    "sectionId": 4,
    "name":"Oliver",
    "paragraph":"We worked well as a team but there were circumstances where deadlines were not met from team members due to personal/work reasons. Communication was down on this assignment from the last as members commitments outside of study got in the way. Most deadlines were met with the help of the rest of the group helping get things done on time. All tasks were assigned on a 50/50 basis with half the group working on the report while the other half worked on the development of the app. Other than those that have been mentioned the group produced a product that we should all be proud of."
  },
  {
    "sectionId": 5,
    "name":"Brearne",
    "paragraph":"We worked well as a team. Unfortunately, due to work commitments, I missed some of the meetings. To make up for this, I watched the videos recordings of the meetings I had missed. Also, where warranted, I posted a video response to any questions raised during the meeting. This way, I maintained communication with the team. Sometimes, in house deadlines were not met. However, as a team, we were able to be supportive and find someone else willing to complete the relevant task. It was also interesting to see group members gravitate to tasks which best matched their ability. This helped in producing the best possible product."
  }
]